app/controllers/students_controller.rb

  def index #students_path
    @students = Student.all
---
SELECT "students".* FROM "students"

  def show #student_path
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]